package tasks

type BinanceCode int

func (c BinanceCode) String() (r string) {
	switch c {
	case -1000:
		r = "处理请求时发生未知错误"
	case -1001:
		r = "内部错误; 无法处理您的请求。 请再试一次"
	case -1002:
		r = "您无权执行此请求参数错误"
	case -1003:
		r = "排队的请求过多"
	case -1004:
		r = "IP地址已经在白名单"
	case -1005:
		r = "白名单上没有此IP地址"
	case -1006:
		r = "从消息总线收到意外的响应。执行状态未知"
	case -1007:
		r = "等待后端服务器响应超时。 发送状态未知； 执行状态未知"
	case -1014:
		r = "不支持当前的下单参数组合"
	case -1015:
		r = "新订单太多"
	case -1016:
		r = "该服务不可用"
	case -1020:
		r = "不支持此操作"
	case -1021:
		r = "此请求的时间戳在recvWindow之外"
	case -1022:
		r = "此请求的签名无效"
	case -1023:
		r = "参数里面的开始时间在结束时间之后"

	case -1100:
		r = "在参数中发现非法字符"
	case -1101:
		r = "为此端点发送的参数太多"
	case -1102:
		r = "未发送强制性参数"
	case -1103:
		r = "发送了未知参数"
	case -1104:
		r = "并非所有发送的参数都被读取"
	case -1105:
		r = "参数为空"
	case -1106:
		r = "发送了不需要的参数"
	case -1111:
		r = "精度超过为此资产定义的最大值"
	case -1112:
		r = "交易对没有挂单"
	case -1114:
		r = "不需要时发送了TimeInForce参数"
	case -1115:
		r = "无效的timeInForce"
	case -1116:
		r = "无效订单类型"
	case -1117:
		r = "无效买卖方向"
	case -1118:
		r = "新的客户订单ID为空"
	case -1119:
		r = "客户自定义的订单ID为空"
	case -1120:
		r = "无效时间间隔"
	case -1121:
		r = "无效的交易对"
	case -1125:
		r = "该listenKey不存在"
	case -1127:
		r = "查询间隔太大"
	case -1128:
		r = "可选参数组合无效"
	case -1130:
		r = "发送的参数为无效数据"

	case -2010:
		r = "新订单被拒绝"
	case -2011:
		r = "取消订单被拒绝"
	case -2013:
		r = "订单不存在"
	case -2014:
		r = "格式无效"
	case -2015:
		r = "无效的API密钥，IP或操作权限"
	case -2016:
		r = "找不到该交易对的交易窗口。 尝试改为24小时自动报价"
	case -2018:
		r = "余额不足"
	case -2019:
		r = "杠杆账户余额不足"
	case -2020:
		r = "无法成交"
	case -2021:
		r = "订单可能被立刻触发"
	case -2022:
		r = "ReduceOnly订单被拒绝"
	case -2023:
		r = "用户正处于被强平模式"
	case -2024:
		r = "持仓不足"
	case -2025:
		r = "挂单量达到上限"
	case -2026:
		r = "当前订单类型不支持reduceOnly"
	case -2027:
		r = "挂单或持仓超出当前初始杠杆下的最大值"
	case -2028:
		r = "调整初始杠杆过低，导致可用余额不足"

	case -4000:
		r = "订单状态不正确"
	case -4001:
		r = "价格小于0"
	case -4002:
		r = "价格超过最大值"
	case -4003:
		r = "数量小于0"
	case -4004:
		r = "数量小于最小值"
	case -4005:
		r = "数量大于最大值"
	case -4006:
		r = "触发价小于最小值"
	case -4007:
		r = "触发价大于最大值"
	case -4008:
		r = "价格精度小于0"
	case -4009:
		r = "最大价格小于最小价格"
	case -4010:
		r = "最大数量小于最小数量"
	case -4011:
		r = "步进值小于0"
	case -4012:
		r = "最大订单量小于0"
	case -4013:
		r = "价格小于最小价格"
	case -4014:
		r = "价格增量不是价格精度的倍数"
	case -4015:
		r = "客户订单ID有误"
	case -4016:
		r = "价格高于标记价格乘数上限"
	case -4017:
		r = "价格上限小于0"
	case -4018:
		r = "价格下限小于0"
	case -4019:
		r = "复合规模太大"
	case -4020:
		r = "目标策略值不适合订单状态"
	case -4021:
		r = "深度信息的limit值不正确"
	case -4022:
		r = "发送的市场状态不正确"
	case -4023:
		r = "数量的递增值不是步进值的倍数"
	case -4024:
		r = "价格低于标价乘数底限"
	case -4025:
		r = "乘数小数小于零"
	case -4026:
		r = "收益值不正确"
	case -4027:
		r = "账户类型不正确"
	case -4028:
		r = "杠杆倍数不正确"
	case -4029:
		r = "价格精度小数点位数不正确"
	case -4030:
		r = "步进值小数点位数不正确"
	case -4031:
		r = "不正确的参数类型"
	case -4032:
		r = "超过可以取消的最大订单量"
	case -4033:
		r = "风险保障基金账号没找到"
	case -4044:
		r = "余额类型不正确"
	case -4045:
		r = "达到止损单的上限"
	case -4046:
		r = "不需要切换仓位模式"
	case -4047:
		r = "如果有挂单，仓位模式不能切换"
	case -4048:
		r = "如果有仓位，仓位模式不能切换"
	case -4049:
		r = "添加保证金仅支持逐仓模式"
	case -4050:
		r = "全仓余额不足"
	case -4051:
		r = "逐仓余额不足"
	case -4052:
		r = "无需更改自动添加保证金"
	case -4053:
		r = "自动增加保证金只适用于逐仓"
	case -4054:
		r = "不能增加逐仓保证金"
	case -4055:
		r = "数量必须是正整数"
	case -4056:
		r = "API key的类型不正确"
	case -4057:
		r = "API key不正确"
	case -4058:
		r = "maxPrice和priceDecimal太大，请检查"
	case -4059:
		r = "无需变更仓位方向"
	case -4060:
		r = "仓位方向不正确"
	case -4061:
		r = "订单的持仓方向和用户设置不一致"
	case -4062:
		r = "仅减仓的设置不正确"
	case -4063:
		r = "无效的期权请求类型"
	case -4064:
		r = "无效的期权时间窗口"
	case -4065:
		r = "无效的期权数量"
	case -4066:
		r = "无效的期权事件类型"
	case -4067:
		r = "如果有挂单，无法修改仓位方向"
	case -4068:
		r = "如果有仓位, 无法修改仓位方向"
	case -4069:
		r = "无效的期权费"
	case -4070:
		r = "客户的期权ID不合法"
	case -4071:
		r = "期权的方向无效"
	case -4072:
		r = "期权费没有更新"
	case -4073:
		r = "输入的期权费小于0"
	case -4074:
		r = "订单金额大于上限或小于0，拒绝订单"
	case -4075:
		r = "输出保费费用小于0，拒绝订单"
	case -4076:
		r = "期权的费用比之前的费用高"
	case -4077:
		r = "下单的数量达到上限"
	case -4078:
		r = "期权内部系统错误"
	case -4079:
		r = "期权ID无效"
	case -4080:
		r = "用户找不到"
	case -4081:
		r = "期权找不到"
	case -4082:
		r = "批量下单的数量不正确"
	case -4083:
		r = "无法批量下单"
	case -4084:
		r = "方法不支持"
	case -4085:
		r = "期权的有限系数不正确"
	case -4086:
		r = "无效的价差阀值"

	default:
	}
	return
}

func BinanceCodeMessage(c int) (r string) {
	return BinanceCode(c).String()
}
